Добро пожаловать в IPython Notebook
--------------------------

Данный notebook печатает классическое `"Hello world!`.

Для запуска блока команд, нажмите на него, и используйте SHIFT+ENTER

Также есть дополнительные keyboard hotkeys (описанные в меню Help)

In [1]:
print ("Hello world!")

Hello world!

Проверим, что у вас подключена возможность работы с SQL

In [2]:
%load_ext sql
%sql sqlite:///tst_1.db

'Connected: None@tst_1.db'

Однострочный SQL-запрос

In [3]:
%sql select 1

Done.

[(1,)]

Многострочный SQL-запрос

In [6]:
%%sql
Select 1
union
select 2

Done.

[(1,), (2,)]

Создадим таблицу Студентов со следующими полями:
1. Student_id - уникальный идентификатор студента
2. Name - имя студента
3. Second Name - фамилия студенты
4. Faculty - факультет студента
5. StudyGroup - группа студента 
6. GPA - средний балл

In [15]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty varchar(20),
    StudyGroup varchar(20),
    GPA number
);

Done.
Done.

[]

Проверим, что таблица создана

In [16]:
%sql select * from Students

Done.

[]

Заполним таблице данными

In [17]:
%%sql
insert into Students(student_id, Name, SecondName, Faculty, StudyGroup, GPA) VALUES (1, 'Anton', 'Sidorov', 'KIB', '101', 3.5);
insert into Students(student_id, Name, SecondName, Faculty, StudyGroup, GPA) VALUES (2, 'Alexey', 'Petrov', 'IT', '201', 3.3);
insert into Students(student_id, Name, SecondName, Faculty, StudyGroup, GPA) VALUES (3, 'Ivan', 'Meshkov', 'KIB', '101', 4.5);
insert into Students(student_id, Name, SecondName, Faculty, StudyGroup, GPA) VALUES (4, 'Elena', 'Kvitova', 'Economics', '301', 4.8);
insert into Students(student_id, Name, SecondName, Faculty, StudyGroup, GPA) VALUES (5, 'Darya', 'Salnikova', 'It', '202', 3.4);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Проверим наличие данных

In [18]:
%sql select * from Students

Done.

[(1, 'Anton', 'Sidorov', 'KIB', '101', 3.5),
 (2, 'Alexey', 'Petrov', 'IT', '201', 3.3),
 (3, 'Ivan', 'Meshkov', 'KIB', '101', 4.5),
 (4, 'Elena', 'Kvitova', 'Economics', '301', 4.8),
 (5, 'Darya', 'Salnikova', 'It', '202', 3.4)]

## Задание 1. Напишите SQL-запрос, возвращающий ваше имя

## Задание 2. Напишите SQL-запрос, возвращающий имена всех студентов с фамилией Sidorov

## Задание 3. Выведите все названия факультетов, на которых учится хотя бы один студент со средним баллом не менее 4. Имя факультета должно встречаться один раз в выводе

## Задание 4. Вывести только тех студентов, фамилия которых начинается с 'S', а в имени присутствует 'a'.

## Задание 5. Вывести только те факультеты, количество групп в которых больше 3